# Задача 1. <br/>
Написать программу, которая считывает с консоли строку определенного формата или    <br/>
несколько строк, Затем получает на основании введенных данных определенную дату и   <br/>
говорит, какой в этот день был день недели. Для того, чтобы вывести день недели на  <br/>
русском языке следует использовать date.getDayOfWeek().getDisplayName(TextStyle.FULL, Locale.forLanguageTag("ru")) <br/>
В случае, когда неверно введена дата, пользователю на консоль выводится <br/>
сообщение "Введенные данные некорректны." А затем снова предлагает ввести дату. <br/>
Если данные введены верно, то программа выводит на экран введеннную дату и  <br/>
русскооязычное название дня недели, после чего завершается. Формат вводимой <br/>
строки для даты выбрать самостоятельно. <br/>